<a href="https://colab.research.google.com/github/NasaSpaceProgram/CS_167_Practive/blob/main/Day03_exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

An example of a markdown cell<br>
Author: <b>Your name here</b><br>
Date: February 4, 2020
# Python and Pandas Exercises

Before you begin, make sure you download the data from Blackboard and put it in your Google Drive where you know how to find it (preferably in a datasets folder).

In [2]:
#selecting columns in dataframes
import pandas
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
#import the data:
#make sure the path on the line below corresponds to the path where you put your dataset.
titanic = pandas.read_csv("/content/drive/MyDrive/CS167/datasets/titanic.csv")
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [4]:
# what is the data type of titanic?
type(titanic)

pandas.core.frame.DataFrame

In [5]:
# what are the features (column titles) of the titanic dataset?
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [6]:
# display only the 'embark_town' column of the titanic data
titanic['embark_town']

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [7]:
# what is the data type of the result of the previous cell? 
type(titanic['embark_town'])

pandas.core.series.Series

In [8]:
# what is the "shape" of the data frame?
titanic.shape

(891, 15)

In [11]:
# make a subset (call the variable 'subset') of the data that consists of the last 20 rows of the data;
# verify that your subset has 20 rows
t = titanic.loc[871:891]
t.head()
t.shape[0]

20

In [15]:
# use loc to print out the data for passenger 890 on the titanic dataframe
# use iloc to print out the data for passenger 890 on the subest dataframe
t.loc[890]
t.iloc[18]

survived               1
pclass                 1
sex                 male
age                   26
sibsp                  0
parch                  0
fare                  30
embarked               C
class              First
who                  man
adult_male          True
deck                   C
embark_town    Cherbourg
alive                yes
alone               True
Name: 889, dtype: object

In [ ]:
# use a markdown cell; describe the difference between loc and iloc

loc uses the label from the origonal data set for indexing
iloc uses the index of the subset for indexing

In [18]:
# create a subset of the data (call the variable 'queenstown_subset') that consists only of passengers with
# a 'embark_town' that is "Queenstown"
# hint: if you get a warning, you may need to explicitly note that you are making a copy of the original data by using 
# the .copy() function
FrmQueens = titanic.copy()
FrmQueens = FrmQueens[FrmQueens['embark_town']=='Queenstown']
FrmQueens.head()

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
5          0       3    male   NaN  ...   NaN   Queenstown     no   True
16         0       3    male   2.0  ...   NaN   Queenstown     no  False
22         1       3  female  15.0  ...   NaN   Queenstown    yes   True
28         1       3  female   NaN  ...   NaN   Queenstown    yes   True
32         1       3  female   NaN  ...   NaN   Queenstown    yes   True

[5 rows x 15 columns]

In [19]:
# how many passengers are in queenstown_subset?
FrmQueens.shape[0]

77

In [20]:
# what is the average fare for all of those in the queenstown_subset?
FrmQueens['fare'].mean()

13.276029870129872

In [23]:
# what is the average age for all of those in the queenstown_subset?
# do all of the passengers have an age recorded? What is recorded if there is no age?
FrmQueens['age'].mean()

28.089285714285715

In [25]:
FrmQueens['age'].unique()

array([ nan,  2. , 15. , 19. , 70.5, 16. ,  4. , 40. , 44. ,  7. , 65. ,
       22. , 30. , 33. , 21. , 29. , 40.5, 57. , 18. , 32. , 25. , 31. ,
       30.5,  8. , 39. ])

In [ ]:
# What does unique(), mean(), isnull(), and fillna() do? Use a markdown cell to write your answers
# Use the Pandas documentation (https://pandas.pydata.org/pandas-docs/stable/reference/index.html)

unique(): retuns a list of all values that appere in a column

mean(): retunrs the average of a column

isnull(): returns true if the value is na or NAN

fillna(value): fills all na values with the value

In [ ]:
# give examples of your use of unique(), mean(), median(), isnull()
FrmQueens['age'].unique()

In [ ]:
FrmQueens['age'].mean()

In [ ]:
FrmQueens['age'].median()

In [26]:
FrmQueens['age'].isnull()

5       True
16     False
22     False
28      True
32      True
       ...
790     True
825     True
828     True
885    False
890    False
Name: age, Length: 77, dtype: bool

In [27]:
# in the queenstown_subet dataframe
# for each row that does not have an age recorded, replace the NaN value with the calculated average
# hint: don't use a loop; it can be done in 1 line of code using fillna()
aveage = FrmQueens['age'].mean()
FrmQueens['age'].fillna(aveage)

5      28.089286
16      2.000000
22     15.000000
28     28.089286
32     28.089286
         ...
790    28.089286
825    28.089286
828    28.089286
885    39.000000
890    32.000000
Name: age, Length: 77, dtype: float64

In [32]:
# load in the iris data
# what is the median sepal width of just the Setosas?
#import the data:
#make sure the path on the line below corresponds to the path where you put your dataset.
iris = pandas.read_csv("/content/drive/MyDrive/CS167/datasets/irisData.csv")
iris.head()

   sepal length  sepal width  petal length  petal width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [33]:
# for those iris that are classified as versicolor and have 
# a petal-length > 4, what is the average sepal width?
iris[iris['petal length'] < 4]['sepal width'].mean()

3.250819672131148